---
kind: method
id: M:Autodesk.Revit.DB.NumericRevisionSettings.#ctor(Autodesk.Revit.DB.NumericRevisionSettings)
source: html/661b729b-b05d-f9ee-bf07-60c5c56f01c9.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.#ctor Method

Constructs a new copy of the input NumericRevisionSettings object.

## Syntax (C#)
```csharp
public NumericRevisionSettings(
	NumericRevisionSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.NumericRevisionSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - other is not a valid NumericRevisionSettings.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null